package classtest;

/* 객체 : 속성, 기능  ==> 코드로 나타낸 것이 클래스임
 *       (변수)(메서드)
 *       
 * 관계 : 상속(확장) / 포함      
 *  상속 : 오버라이딩, 다형성      
 *  
 *  final : 클래스(상속금지), 메소드(오버라이딩 금지), 변수(수정 금지)
 */
public class Total {
	// 속성 : 기본타입, 참조타입(배열,클래스) 
	//        속성은 외부로 보여지지 않도록 작성(private)
	//        상수 : static final 대문자=초기값;       
	
	// 생성자: 여러개 올 수 있음(생성자 오버로딩)
	//         다양한 방법으로 객체 초기화 가능
	//  목적 : 객체 초기화, 객체를 생성하면서 해야할 사전 작업       
	
	
	// 메소드 : 반복작업이나 어떤 기능을 제공할 때 사용
	//        : get~~() : 값을 내보낼때
	//        : set~~() : 값을 변경하거나 새로 초기화 할 때
	//        : 외부에서 접근 가능하도록 작성(public)
	
	
}




























